openFoamRepoDev/tutorials/compressible/rhoPimpleFoam/laminar/helmholtzResonance/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.05;

deltaT          1e-4;

writeControl    adjustable;

writeInterval   1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

functions
{
    probes
    {
        libs            (sampling);
        type            probes;
        name            probes;
        writeControl    timeStep;
        writeInterval   1;
        fields          (p);
        probeLocations
        (
            ( -0.045  0     0     )
            ( -0.045  0.020 0     )
            ( -0.010  0     0     )
            (  0.0125 0     0     )
            (  0.0125 0.020 0     )
        );
    }
}


// ************************************************************************* //
